{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_2",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            48,
            48,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "separable_conv2d_20_input"
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_20",
          "trainable": true,
          "batch_input_shape": [
            null,
            48,
            48,
            1
          ],
          "dtype": "float32",
          "filters": 48,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_18",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_18",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_21",
          "trainable": true,
          "dtype": "float32",
          "filters": 48,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_19",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_19",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_22",
          "trainable": true,
          "dtype": "float32",
          "filters": 48,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_20",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_8",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_8",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_20",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_23",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_21",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_21",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_24",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_22",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_22",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_25",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_23",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_9",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_9",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_23",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_26",
          "trainable": true,
          "dtype": "float32",
          "filters": 192,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_24",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_24",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_27",
          "trainable": true,
          "dtype": "float32",
          "filters": 192,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_25",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_10",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_10",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_25",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_28",
          "trainable": true,
          "dtype": "float32",
          "filters": 384,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L2",
            "config": {
              "l2": 0.009999999776482582
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_26",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_11",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "SpatialDropout2D",
        "config": {
          "name": "spatial_dropout2d_11",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_re_lu_26",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.019999999552965164
        }
      },
      {
        "class_name": "SeparableConv2D",
        "config": {
          "name": "separable_conv2d_29",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "depth_multiplier": 1,
          "depthwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "pointwise_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "depthwise_regularizer": null,
          "pointwise_regularizer": null,
          "depthwise_constraint": null,
          "pointwise_constraint": null
        }
      },
      {
        "class_name": "GlobalAveragePooling2D",
        "config": {
          "name": "global_average_pooling2d_2",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        }
      }
    ]
  }
}